import { EmbedBuilder } from "discord.js";

export const embeds =
    [new EmbedBuilder()
        .setImage("https://firebasestorage.googleapis.com/v0/b/filesuwizx.appspot.com/o/relaxzone%2FRelaxzone%20Banner.jpg?alt=media&token=cdfc7e32-ead9-4100-b909-3bac6cb32b31")
        .setColor("#FF2056"),
    new EmbedBuilder()
        .setDescription(`
### 1. ❌ ห้ามใช้วาจาหยาบคาย  
ห้ามดูหมิ่น เหยียดหยาม หรือสร้างความขัดแย้งกับสมาชิกคนอื่น  

### 2. 🛡️ ห้ามละเมิดสิทธิของผู้อื่น  
ไม่อนุญาตให้ส่งเสริมการละเมิดสิทธิหรือการกระทำที่ไม่เป็นธรรม  

### 3. 🔞 เนื้อหาทางเพศ / รูปอนาจาร  
- ห้ามสนทนาหรือโพสต์เนื้อหาลักษณะทางเพศในพื้นที่สาธารณะ  
- หากพบ **ครั้งที่ 1 → ตักเตือน**  
- หากพบ **ครั้งที่ 2 → แบนถาวร**  

### 4. 🔗 ลิงก์ต้องห้าม  
ห้ามโพสต์ลิงก์ฟิชชิ่ง, สแปม, โฆษณา หรือเว็บไซต์ที่เป็นอันตราย  

### 5. 🙅 ห้ามทำให้ผู้อื่นอับอาย  
ไม่อนุญาตให้กระทำการที่ทำให้ผู้อื่นรู้สึกเสียหน้า หรือเสื่อมเสียชื่อเสียง  

### 6. 🎭 ห้ามปลอมแปลงตัวตน  
ห้ามแอบอ้างเป็นผู้อื่นเพื่อหลอกลวง ก่ออาชญากรรม หรือทำร้ายผู้อื่น  

### 7. 📷 การใช้รูป/เนื้อหาของผู้อื่น  
ห้ามนำรูปภาพ ข้อความ หรือข้อมูลส่วนตัวของผู้อื่น (เช่น รูปโปรไฟล์, แชท, โพสต์) มาเผยแพร่โดยไม่ได้รับอนุญาต  

---

## 👑 หมายเหตุสำคัญ  
**แอดมินมีอำนาจสูงสุด**  
การตัดสินใจของแอดมินถือเป็นที่สิ้นสุด

  `)
        .setColor("#FF2056")
    ]
